; domain
(define (domain grid)
(:requirements :strips)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos)
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem grid-2-2-1-1-1)
    (:domain grid)
    (:objects
    pos0-0 pos0-1 pos1-0 pos1-1
    shape0
    key0
    )

    (:init
       (arm-empty)

       (place pos0-0)
       (place pos0-1)
       (place pos1-0)
       (place pos1-1)
       (shape shape0)
       (key key0)

       (conn pos0-0 pos1-0)
       (conn pos0-0 pos0-1)
       (conn pos0-1 pos1-1)
       (conn pos0-1 pos0-0)
       (conn pos1-0 pos1-1)
       (conn pos1-0 pos0-0)
       (conn pos1-1 pos0-1)
       (conn pos1-1 pos1-0)
       (locked pos0-1)
       (lock-shape  pos0-1 shape0)
       (open pos0-0)
       (open pos1-0)
       (open pos1-1)

       (key-shape  key0 shape0)
       (at key0 pos1-1)
       (at-robot pos0-0)
    )

    (:goal (and
       (at key0 pos0-1)
    )))

; plan
1. (move pos0-0 pos1-0)
   deleted: (at-robot pos0-0)
   added: (at-robot pos1-0)
   goals met: 0 of 1
2. (move pos1-0 pos1-1)
   deleted: (at-robot pos1-0)
   added: (at-robot pos1-1)
   goals met: 0 of 1
3. (pickup pos1-1 key0)
   deleted: (at key0 pos1-1) (arm-empty)
   added: (holding key0)
   goals met: 0 of 1
4. (unlock pos1-1 pos0-1 key0 shape0)
   deleted: (locked pos0-1)
   added: (open pos0-1)
   goals met: 0 of 1
5. (move pos1-1 pos0-1)
   deleted: (at-robot pos1-1)
   added: (at-robot pos0-1)
   goals met: 0 of 1
6. (putdown pos0-1 key0)
   deleted: (holding key0)
   added: (arm-empty) (at key0 pos0-1)
   goals met: 1 of 1
